InformationRegisters/НастройкиБП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>НастройкиБП</Name>
			<Comment>Трейд Софт</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Схема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КартыМаршрутов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОперацииБП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/КартыМаршрутов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>КартыМаршрутов</Name>
			<Comment>Трейд Софт</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Схема</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКорректна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОперацииБП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодсказкаМероприятий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбъектыУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Выходы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РезультатыОперацийБП</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РезультатыОперацийБП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Стадии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидСтадии</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыСтадийБП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Операция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОперацииБП</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Стадия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КартыМаршрутов</v8:Type>
								<v8:Type>cfg:CatalogRef.ТипыМероприятий</v8:Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
								<v8:Type>cfg:CatalogRef.ФункцииБизнесПроцессов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапретСтарта</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокВыполнения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Задержки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаЗадержки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектНачало</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантНачало</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектКонец</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОжидатьВФоне</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Сумматоры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Варианты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
								<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/НастройкиБП/Ext/ManagerModule.bsl
Функция ПолучитьСхемуПоОперации(Организация, Подразделение, Операция) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НастройкиБП.Схема
	                      |ИЗ
	                      |	РегистрСведений.НастройкиБП КАК НастройкиБП
	                      |ГДЕ
	                      |	НастройкиБП.Организация = &Организация
	                      |	И (НастройкиБП.Подразделение = &Подразделение
	                      |			ИЛИ НастройкиБП.Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка))
	                      |	И НастройкиБП.Операция = &Операция
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	НастройкиБП.Подразделение УБЫВ");
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Операция", Операция);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Схема;
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	НастройкиБП.Схема,
		               |	НастройкиБП.Подразделение
		               |ИЗ
		               |	РегистрСведений.НастройкиБП КАК НастройкиБП
		               |ГДЕ
		               |	НастройкиБП.Организация = &Организация
		               |	И НастройкиБП.Операция = &Операция";
		Таблица = Запрос.Выполнить().Выгрузить();
		Если Таблица.Количество() = 1 Тогда
			Подразделение = Таблица[0].Подразделение;
			Возврат Таблица[0].Схема;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
КонецФункции


Функция ЗаполнитьДанныеДляЗапускаСВыбраннойСтадии(ЗапускБП, Операция) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	КартыМаршрутовСтадии.Ссылка КАК Ссылка,
	                      |	КартыМаршрутовСтадии.НомерСтроки КАК НомерСтроки,
	                      |	КартыМаршрутовСтадии.Идентификатор КАК Идентификатор,
	                      |	КартыМаршрутовСтадии.Наименование КАК Наименование,
	                      |	КартыМаршрутовСтадии.ВидСтадии КАК ВидСтадии,
	                      |	КартыМаршрутовСтадии.Операция КАК Операция,
	                      |	КартыМаршрутовСтадии.Исполнитель КАК Исполнитель,
	                      |	КартыМаршрутовСтадии.Стадия КАК Стадия,
	                      |	КартыМаршрутовСтадии.ЗапретСтарта КАК ЗапретСтарта
	                      |ИЗ
	                      |	Справочник.КартыМаршрутов.Стадии КАК КартыМаршрутовСтадии
	                      |ГДЕ
	                      |	КартыМаршрутовСтадии.Операция = &Операция");
	Запрос.УстановитьПараметр("Операция", Операция);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		ТСИсполнитель = Результат.Исполнитель;
		ТСОбъектРодитель = "";
		ТССхема = Результат.Ссылка;
		ТСТипМероприятия = Результат.Стадия;
		ТСТочка = Результат.Идентификатор;
		
		ТСМассив = Новый ТаблицаЗначений;
		ТСМассив.Колонки.Добавить("Идентификатор");
		ТСМассив.Колонки.Добавить("ОбъектРодитель");
		ТСМассив.Колонки.Добавить("Схема");
		Стр = ТСМассив.Добавить();
		Стр.Идентификатор = ТСТочка;
		Стр.ОбъектРодитель = ТСОбъектРодитель;
		Стр.Схема = ТССхема;
		
		//ЗапускБП = Документы.ЗапускБП.СоздатьДокумент();
		//Стр = Новый Структура("Идентификатор, ОбъектРодитель, Схема", ТСТочка, ТСОбъектРодитель, ТССхема);
		//ТСМассив.Добавить(Стр);
		МассивДанных = Новый Структура("ТСИсполнитель, ТСОбъектРодитель, ТССхема, ТСТипМероприятия, ТСТочка, ТСМассив", 
			ТСИсполнитель, ТСОбъектРодитель, ТССхема, ТСТипМероприятия, ТСТочка, ТСМассив);          
		ЗапускБП.Схема = ТССхема;
		ЗапускБП.Подразделение = ТССхема.Подразделение;
		ЗапускБП.ПоместитьВХранилище(МассивДанных);
		ЗапускБП.ТССтартоватьСВыбраннойСтадии = Истина;
		ЗапускБП.ТСПуть = ТССхема.Наименование;
		ЗапускБП.ТСМероприятие = Операция.Наименование; 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции

Процедура ДобавитьСоответствие(Схема, Операция) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НастройкиБП.Схема
	                      |ИЗ
	                      |	РегистрСведений.НастройкиБП КАК НастройкиБП
	                      |ГДЕ
	                      |	НастройкиБП.Операция = &Операция");
	Запрос.УстановитьПараметр("Операция", Операция);
	Если Запрос.Выполнить().Пустой() Тогда
		Набор = РегистрыСведений.НастройкиБП.СоздатьМенеджерЗаписи();		
		//Набор.Организация = Операция.Организация;
		//Набор.Подразделение = Операция.Подразделение;
		Набор.Операция = Операция;
		Набор.Схема = Схема;
		Набор.Записать();
	КонецЕсли;
КонецПроцедуры
